Revit 2024 API
ImageInstance.LockProportions Property
 When true the proportion of Width to Height will be maintained
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public bool LockProportions { get; set; }
Visual Basic
Public Property LockProportions As Boolean
	Get
	Set
Visual C++
public:
property bool LockProportions {
	bool get ();
	void set (bool value);
}
See Also
ImageInstance Class
Autodesk.Revit.DB Namespace